#+title: Advent of Learning Code
#+author: Garid Z.
#+date: [2022-12-03 Sat 22:55]
* Advent of Learning Code
I try to learn new programming language by solving problems provided from [[https://adventofcode.com/][Advent of Code]].

* Solved Problems
|--------+------+------+------|
|        | [[https://adventofcode.com/2022][2022]] | [[https://adventofcode.com/2021][2021]] | [[https://adventofcode.com/2020][2020]] |
|        |   [[https://go.dev/][Go]] | [[https://www.rust-lang.org/][Rust]] |  [[https://nim-lang.org/][Nim]] |
|--------+------+------+------|
| day-01 |    2 |    2 |    2 |
| day-02 |    2 |    2 |    2 |
| day-03 |    2 |    1 |    2 |
| day-04 |    2 |      |    2 |
| day-05 |    2 |      |    2 |
| day-06 |    2 |      |    2 |
| day-07 |    2 |      |    2 |
| day-08 |    2 |      |    2 |
| day-09 |    2 |      |    2 |
| day-10 |    2 |      |      |
| day-11 |    2 |      |    2 |
| day-12 |    2 |      |      |
| day-13 |    2 |      |      |
| day-14 |    2 |      |      |
| day-15 |    2 |      |      |
| day-16 |      |      |      |
| day-17 |    2 |      |    2 |
| day-18 |    2 |      |    2 |
| day-19 |      |      |      |
| day-20 |      |      |      |
| day-21 |    2 |      |      |
| day-22 |    2 |      |      |
| day-23 |    2 |      |      |
| day-24 |    2 |      |      |
| day-25 |    1 |      |      |
|--------+------+------+------|
|        |   43 |    5 |   24 |
|--------+------+------+------|
#+TBLFM: @>$2=vsum(@3..@-1)::@>$3=vsum(@3..@-1)::::@>$4=vsum(@3..@-1)

